Revit 2026 API

# NonContinuousRailInfo Class

---

A class which contains information needed to define a single non-continuous rail in a [!:Autodesk::Revit::DB::Architecture::RailingType].

SystemObject Autodesk.Revit.DB.ArchitectureNonContinuousRailInfo

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class NonContinuousRailInfo : IDisposable
```
```vb
Public Class NonContinuousRailInfo
	Implements IDisposable
```
```cpp
public ref class NonContinuousRailInfo : IDisposable
```
```fsharp
type NonContinuousRailInfo =
    class
        interface IDisposable
    end
```

The NonContinuousRailInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Height | The height at which the non-continuous rail will be placed. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MaterialId | The material id associated with the non-continuous rail, or invalidElementId if none. |
|  | Name | The name of the non-continuous rail. |
|  | Offset | The side offset of the non-continuous rail from a [!:Autodesk::Revit::DB::Architecture::Railing] from the railing center. |
|  | ProfileId | The profile id of the non-continuous rail, or invalidElementId if none. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the NonContinuousRailInfo |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValidNonContinuousRailHeight | Checks whether the input height is valid for a non-continuous rail in its associated railing type. |
|  | IsValidNonContinuousRailMaterial | Checks whether an ElementId is a valid material Id of a non-continuous rail. |
|  | IsValidNonContinuousRailName | Checks whether the input name is valid for a non-continuous rail in its associated railing type. |
|  | IsValidNonContinuousRailProfile | Checks whether the input id represents a profile which can be used as the profile of this non-continuous rail. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Architecture Namespace